BenchmarkOutput/puts_gets/normal_E.txt
[OVERALL], RunTime(ms), 75353
[OVERALL], Throughput(ops/sec), 13.270871763566149
[TOTAL_GCS_PS_Scavenge], Count, 5
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 21
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.027868830703488914
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 21
[TOTAL_GC_TIME_%], Time(%), 0.027868830703488914
[READ], Operations, 484
[READ], AverageLatency(us), 93222.80991735538
[READ], MinLatency(us), 57152
[READ], MaxLatency(us), 410367
[READ], 25thPercentileLatency(us), 58271
[READ], 50thPercentileLatency(us), 104895
[READ], 75thPercentileLatency(us), 110463
[READ], 90thPercentileLatency(us), 114175
[READ], 95thPercentileLatency(us), 115199
[READ], 99thPercentileLatency(us), 120127
[READ], Return=OK, 484
[READ], 57183, 1.0
[READ], 57215, 1.0
[READ], 57279, 2.0
[READ], 57311, 2.0
[READ], 57343, 2.0
[READ], 57375, 1.0
[READ], 57407, 6.0
[READ], 57439, 7.0
[READ], 57471, 1.0
[READ], 57503, 6.0
[READ], 57535, 8.0
[READ], 57567, 5.0
[READ], 57599, 8.0
[READ], 57631, 6.0
[READ], 57663, 6.0
[READ], 57695, 6.0
[READ], 57727, 7.0
[READ], 57759, 3.0
[READ], 57791, 4.0
[READ], 57823, 4.0
[READ], 57855, 5.0
[READ], 57887, 3.0
[READ], 57919, 3.0
[READ], 57951, 3.0
[READ], 57983, 2.0
[READ], 58015, 3.0
[READ], 58047, 3.0
[READ], 58079, 5.0
[READ], 58111, 3.0
[READ], 58207, 2.0
[READ], 58239, 2.0
[READ], 58271, 2.0
[READ], 58367, 1.0
[READ], 58399, 3.0
[READ], 58687, 1.0
[READ], 58719, 1.0
[READ], 58783, 1.0
[READ], 58815, 1.0
[READ], 58847, 3.0
[READ], 58943, 1.0
[READ], 58975, 1.0
[READ], 59071, 1.0
[READ], 59167, 1.0
[READ], 59231, 1.0
[READ], 59839, 1.0
[READ], 59903, 1.0
[READ], 60063, 1.0
[READ], 60127, 1.0
[READ], 60191, 1.0
[READ], 60703, 1.0
[READ], 60799, 1.0
[READ], 61119, 1.0
[READ], 62015, 1.0
[READ], 62271, 1.0
[READ], 63679, 1.0
[READ], 63839, 1.0
[READ], 64479, 1.0
[READ], 64671, 1.0
[READ], 65791, 1.0
[READ], 66687, 1.0
[READ], 68543, 1.0
[READ], 97343, 1.0
[READ], 97791, 1.0
[READ], 98303, 1.0
[READ], 98431, 1.0
[READ], 98559, 3.0
[READ], 98943, 1.0
[READ], 99135, 2.0
[READ], 99199, 1.0
[READ], 99455, 1.0
[READ], 99519, 2.0
[READ], 99583, 1.0
[READ], 99647, 2.0
[READ], 99711, 2.0
[READ], 99775, 1.0
[READ], 99839, 1.0
[READ], 99903, 2.0
[READ], 99967, 1.0
[READ], 100095, 1.0
[READ], 100159, 1.0
[READ], 100287, 1.0
[READ], 100351, 1.0
[READ], 100607, 2.0
[READ], 100735, 1.0
[READ], 100863, 1.0
[READ], 100991, 1.0
[READ], 101119, 1.0
[READ], 101183, 1.0
[READ], 101311, 1.0
[READ], 101375, 2.0
[READ], 101439, 2.0
[READ], 101567, 1.0
[READ], 101695, 1.0
[READ], 101823, 1.0
[READ], 101887, 3.0
[READ], 101951, 1.0
[READ], 102015, 2.0
[READ], 102079, 4.0
[READ], 102207, 1.0
[READ], 102271, 2.0
[READ], 102399, 1.0
[READ], 102463, 1.0
[READ], 102527, 2.0
[READ], 102719, 1.0
[READ], 102783, 1.0
[READ], 102911, 2.0
[READ], 102975, 1.0
[READ], 103359, 1.0
[READ], 103615, 2.0
[READ], 103679, 1.0
[READ], 103743, 1.0
[READ], 103871, 1.0
[READ], 103935, 2.0
[READ], 104191, 2.0
[READ], 104575, 1.0
[READ], 104639, 2.0
[READ], 104703, 3.0
[READ], 104831, 5.0
[READ], 104895, 2.0
[READ], 104959, 1.0
[READ], 105023, 1.0
[READ], 105215, 2.0
[READ], 105279, 1.0
[READ], 105535, 1.0
[READ], 105599, 1.0
[READ], 105663, 1.0
[READ], 105919, 1.0
[READ], 105983, 1.0
[READ], 106303, 1.0
[READ], 106367, 1.0
[READ], 106495, 1.0
[READ], 106751, 1.0
[READ], 106815, 2.0
[READ], 106879, 2.0
[READ], 106943, 1.0
[READ], 107199, 3.0
[READ], 107263, 1.0
[READ], 107327, 3.0
[READ], 107391, 1.0
[READ], 107519, 1.0
[READ], 107583, 3.0
[READ], 107647, 1.0
[READ], 107711, 4.0
[READ], 107775, 2.0
[READ], 107903, 2.0
[READ], 107967, 2.0
[READ], 108031, 5.0
[READ], 108159, 3.0
[READ], 108223, 1.0
[READ], 108287, 2.0
[READ], 108351, 2.0
[READ], 108415, 2.0
[READ], 108479, 2.0
[READ], 108543, 1.0
[READ], 108607, 2.0
[READ], 108671, 1.0
[READ], 108735, 4.0
[READ], 108799, 4.0
[READ], 108863, 3.0
[READ], 108927, 3.0
[READ], 108991, 2.0
[READ], 109055, 2.0
[READ], 109119, 1.0
[READ], 109183, 1.0
[READ], 109247, 2.0
[READ], 109311, 1.0
[READ], 109375, 3.0
[READ], 109439, 1.0
[READ], 109503, 3.0
[READ], 109567, 1.0
[READ], 109631, 2.0
[READ], 109695, 1.0
[READ], 109759, 3.0
[READ], 109887, 3.0
[READ], 109951, 4.0
[READ], 110015, 2.0
[READ], 110079, 1.0
[READ], 110143, 1.0
[READ], 110271, 3.0
[READ], 110335, 3.0
[READ], 110399, 1.0
[READ], 110463, 2.0
[READ], 110655, 3.0
[READ], 110719, 1.0
[READ], 110783, 1.0
[READ], 110847, 1.0
[READ], 110975, 1.0
[READ], 111039, 3.0
[READ], 111167, 2.0
[READ], 111231, 1.0
[READ], 111295, 2.0
[READ], 111359, 1.0
[READ], 111423, 1.0
[READ], 111487, 1.0
[READ], 111551, 1.0
[READ], 111615, 1.0
[READ], 111743, 2.0
[READ], 111807, 1.0
[READ], 111871, 1.0
[READ], 111935, 2.0
[READ], 112127, 1.0
[READ], 112191, 2.0
[READ], 112255, 1.0
[READ], 112319, 3.0
[READ], 112383, 2.0
[READ], 112447, 1.0
[READ], 112575, 1.0
[READ], 112639, 1.0
[READ], 112703, 1.0
[READ], 112767, 1.0
[READ], 112959, 3.0
[READ], 113087, 1.0
[READ], 113215, 3.0
[READ], 113343, 2.0
[READ], 113407, 2.0
[READ], 113471, 1.0
[READ], 113535, 1.0
[READ], 113599, 1.0
[READ], 113663, 4.0
[READ], 113727, 3.0
[READ], 113791, 1.0
[READ], 113855, 1.0
[READ], 113919, 1.0
[READ], 113983, 2.0
[READ], 114047, 3.0
[READ], 114111, 1.0
[READ], 114175, 3.0
[READ], 114239, 2.0
[READ], 114495, 4.0
[READ], 114559, 3.0
[READ], 114623, 2.0
[READ], 114687, 4.0
[READ], 114879, 1.0
[READ], 114943, 5.0
[READ], 115071, 2.0
[READ], 115199, 2.0
[READ], 115455, 1.0
[READ], 115519, 3.0
[READ], 115711, 1.0
[READ], 115839, 2.0
[READ], 115903, 1.0
[READ], 116031, 1.0
[READ], 116415, 1.0
[READ], 117183, 1.0
[READ], 117247, 1.0
[READ], 117311, 1.0
[READ], 118079, 1.0
[READ], 118335, 1.0
[READ], 118527, 1.0
[READ], 118655, 1.0
[READ], 120127, 1.0
[READ], 130111, 1.0
[READ], 131583, 1.0
[READ], 135679, 2.0
[READ], 410367, 1.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1206.0
[CLEANUP], MinLatency(us), 1206
[CLEANUP], MaxLatency(us), 1206
[CLEANUP], 25thPercentileLatency(us), 1206
[CLEANUP], 50thPercentileLatency(us), 1206
[CLEANUP], 75thPercentileLatency(us), 1206
[CLEANUP], 90thPercentileLatency(us), 1206
[CLEANUP], 95thPercentileLatency(us), 1206
[CLEANUP], 99thPercentileLatency(us), 1206
[CLEANUP], 1206, 1.0
[INSERT], Operations, 516
[INSERT], AverageLatency(us), 58153.20930232558
[INSERT], MinLatency(us), 56512
[INSERT], MaxLatency(us), 78335
[INSERT], 25thPercentileLatency(us), 57503
[INSERT], 50thPercentileLatency(us), 57951
[INSERT], 75thPercentileLatency(us), 58335
[INSERT], 90thPercentileLatency(us), 58655
[INSERT], 95thPercentileLatency(us), 59391
[INSERT], 99thPercentileLatency(us), 65407
[INSERT], Return=OK, 516
[INSERT], 56543, 1.0
[INSERT], 56671, 1.0
[INSERT], 56735, 1.0
[INSERT], 56799, 1.0
[INSERT], 56831, 4.0
[INSERT], 56927, 1.0
[INSERT], 56959, 3.0
[INSERT], 56991, 2.0
[INSERT], 57023, 6.0
[INSERT], 57055, 2.0
[INSERT], 57087, 8.0
[INSERT], 57119, 7.0
[INSERT], 57151, 11.0
[INSERT], 57183, 8.0
[INSERT], 57215, 8.0
[INSERT], 57247, 9.0
[INSERT], 57279, 7.0
[INSERT], 57311, 9.0
[INSERT], 57343, 9.0
[INSERT], 57375, 4.0
[INSERT], 57407, 6.0
[INSERT], 57439, 9.0
[INSERT], 57471, 9.0
[INSERT], 57503, 5.0
[INSERT], 57535, 12.0
[INSERT], 57567, 7.0
[INSERT], 57599, 9.0
[INSERT], 57631, 11.0
[INSERT], 57663, 9.0
[INSERT], 57695, 10.0
[INSERT], 57727, 12.0
[INSERT], 57759, 4.0
[INSERT], 57791, 7.0
[INSERT], 57823, 6.0
[INSERT], 57855, 9.0
[INSERT], 57887, 8.0
[INSERT], 57919, 12.0
[INSERT], 57951, 16.0
[INSERT], 57983, 15.0
[INSERT], 58015, 11.0
[INSERT], 58047, 13.0
[INSERT], 58079, 12.0
[INSERT], 58111, 11.0
[INSERT], 58143, 10.0
[INSERT], 58175, 6.0
[INSERT], 58207, 11.0
[INSERT], 58239, 11.0
[INSERT], 58271, 9.0
[INSERT], 58303, 12.0
[INSERT], 58335, 10.0
[INSERT], 58367, 8.0
[INSERT], 58399, 14.0
[INSERT], 58431, 9.0
[INSERT], 58463, 4.0
[INSERT], 58495, 8.0
[INSERT], 58527, 6.0
[INSERT], 58559, 9.0
[INSERT], 58591, 4.0
[INSERT], 58623, 6.0
[INSERT], 58655, 2.0
[INSERT], 58687, 3.0
[INSERT], 58719, 2.0
[INSERT], 58751, 2.0
[INSERT], 58783, 1.0
[INSERT], 58815, 1.0
[INSERT], 58847, 1.0
[INSERT], 58911, 5.0
[INSERT], 58943, 1.0
[INSERT], 58975, 1.0
[INSERT], 59135, 1.0
[INSERT], 59167, 1.0
[INSERT], 59199, 3.0
[INSERT], 59295, 1.0
[INSERT], 59327, 2.0
[INSERT], 59391, 1.0
[INSERT], 59455, 2.0
[INSERT], 59487, 1.0
[INSERT], 59679, 2.0
[INSERT], 59743, 1.0
[INSERT], 59807, 1.0
[INSERT], 60031, 1.0
[INSERT], 60511, 1.0
[INSERT], 61375, 1.0
[INSERT], 61407, 1.0
[INSERT], 61471, 1.0
[INSERT], 61535, 1.0
[INSERT], 61951, 1.0
[INSERT], 62271, 1.0
[INSERT], 63295, 1.0
[INSERT], 63775, 2.0
[INSERT], 64543, 1.0
[INSERT], 64575, 1.0
[INSERT], 65407, 1.0
[INSERT], 66047, 1.0
[INSERT], 69823, 1.0
[INSERT], 70655, 1.0
[INSERT], 73215, 1.0
[INSERT], 78335, 1.0